{
  "plugins": {
    "BufOnly.nvim": {
      "src": "https://github.com/numtostr/BufOnly.nvim.git"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp.git",
      "version": "1.0.0 - 2.0.0"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim.git"
    },
    "dashboard-nvim": {
      "src": "https://github.com/nvimdev/dashboard-nvim.git"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim.git"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim.git"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets.git"
    },
    "git-messenger.vim": {
      "src": "https://github.com/rhysd/git-messenger.vim.git"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon.git",
      "version": "'harpoon2'"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim.git"
    },
    "lsp_signature.nvim": {
      "src": "https://github.com/ray-x/lsp_signature.nvim.git"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim.git"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim.git"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim.git"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim.git"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig.git"
    },
    "nvim-numbertoggle": {
      "src": "https://github.com/sitiom/nvim-numbertoggle.git"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter.git",
      "version": "'main'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context.git"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects.git",
      "version": "'main'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim.git"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim.git"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim.git"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim.git"
    },
    "swap-split.nvim": {
      "src": "https://github.com/xorid/swap-split.nvim.git"
    },
    "tint.nvim": {
      "src": "https://github.com/levouh/tint.nvim.git"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim.git"
    },
    "vim-sleuth": {
      "src": "https://github.com/tpope/vim-sleuth.git"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator.git"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
