{
  "plugins": {
    "BufOnly.nvim": {
      "src": "https://github.com/numtostr/BufOnly.nvim.git"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim.git"
    },
    "dashboard-nvim": {
      "src": "https://github.com/nvimdev/dashboard-nvim.git"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim.git"
    },
    "git-messenger.vim": {
      "src": "https://github.com/rhysd/git-messenger.vim.git"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon.git",
      "version": "'harpoon2'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim.git"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim.git"
    },
    "nvim-numbertoggle": {
      "src": "https://github.com/sitiom/nvim-numbertoggle.git"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim.git"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim.git"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim.git"
    },
    "swap-split.nvim": {
      "src": "https://github.com/xorid/swap-split.nvim.git"
    },
    "tint.nvim": {
      "src": "https://github.com/levouh/tint.nvim.git"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim.git"
    },
    "vim-sleuth": {
      "src": "https://github.com/tpope/vim-sleuth.git"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator.git"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}